# Урок: Pandas — базовая работа с таблицами
# Автор: RezPoin
# Цель: познакомиться с библиотекой pandas и научиться работать с таблицами

import pandas as pd  # импортируем библиотеку pandas

# ==============================
# 1. Создаем DataFrame вручную
# ==============================
data = {
    'Имя': ['Анна', 'Борис', 'Виктор', 'Галина'],
    'Возраст': [23, 35, 19, 42],
    'Оценка': [88, 92, 75, 95]
}

df = pd.DataFrame(data)  # создаем таблицу
print("DataFrame:\n", df)

# ==============================
# 2. Доступ к столбцам
# ==============================
print("\nСтолбец 'Имя':\n", df['Имя'])

# ==============================
# 3. Доступ к строкам
# ==============================
print("\nПервая строка:\n", df.loc[0])       # по индексу
print("\nСтроки с индексами 1 и 2:\n", df.loc[1:2])

# ==============================
# 4. Фильтрация данных
# ==============================
# Найти всех студентов с оценкой больше 85
high_scores = df[df['Оценка'] > 85]
print("\nСтуденты с оценкой > 85:\n", high_scores)

# ==============================
# 5. Сортировка данных
# ==============================
# Сортировка по возрасту
sorted_by_age = df.sort_values(by='Возраст')
print("\nСортировка по возрасту:\n", sorted_by_age)

# ==============================
# 6. Чтение и запись CSV
# ==============================
# Сохраняем DataFrame в файл
df.to_csv('students.csv', index=False)
print("\nDataFrame сохранен в 'students.csv'")

# Чтение CSV файла
df_from_csv = pd.read_csv('students.csv')
print("\nDataFrame из CSV:\n", df_from_csv)
